function d=delta(a,b,n)
% ЗАБРАКОВАНО!
%d=( b.^(n)-a.^(n) )./n; Проблематична формула, що призводить до проблеми...
% з аргументами a=-x та b=x для функції повного ортогонального базису....
% Таким чином було вирішено оптимізівати дану функції скоротивши її на
% доданок (a-b) за допомогою формул скороченого множення для будь яких
% степенів: a^n-b^n=( a-b )*( a^(n-1)+a^(n-2)*b^1+a^(n-3)*b^(2)+...
% ...+a^2*b^(n-3)+a^1*b^(n-2)+b^(n-1) )
Sum=0;
for k=0:n-1
    Sum=b.^(n-1-k).*a.^k+Sum;
end
d=Sum./n;
end
